package com.plumsoftware.rucalendar;

class ArraysCelebrations {
//    //JANUARY
//    private int[] j1 = new int[]{0, 1};
//    private int[] j2 = new int[]{0, 2};
//    private int[] j3 = new int[]{0, 3};
//    private int[] j4 = new int[]{0, 4};
//    private int[] j5 = new int[]{0, 5};
//    private int[] j6 = new int[]{0, 6};
//    private int[] j7 = new int[]{0, 7};
//    private int[] j8 = new int[]{0, 8};
//    private int[] j12 = new int[]{0, 12};
//    private int[] j13 = new int[]{0, 13};
//    private int[] j14 = new int[]{0, 14};
//    private int[] j21 = new int[]{0, 21};
//    private int[] j25 = new int[]{0, 25};
//    private int[] j27 = new int[]{0, 27};
//    //FEBRUARY
//    private int[] f8 = new int[]{1, 8};
//    private int[] f9 = new int[]{1, 9};
//    private int[] f10 = new int[]{1, 10};
//    private int[] f14 = new int[]{1, 14};
//    private int[] f15 = new int[]{1, 15};
//    private int[] f23 = new int[]{1, 23};
//    private int[] f27 = new int[]{1, 27};
//    //MARCH

    String check(int[] i) {
        switch (i[0]) {
            case 0:
                switch (i[1]) {
                    case 1:
                        return "Новогодние каникулы! \uD83C\uDF84 ~Государственный праздник, выходной день. Новогодние каникулы продолжаются в среднем 8-10 дней, и заканчиваются после Рождественских праздников.\n" +
                                "\n" +
                                "Новый год отмечается всеми жителями страны в ночь с 31 декабря на 1 января. Традиции его празднования имеют давнюю историю. С 1992 года и 2 января также стало выходным, а с 2013-го в России новогодние каникулы увеличились до 8 дней (с 1 по 8 января).\n" +
                                "\n" +
                                "Новогодние символы российского Нового года – Дед Мороз, Снегурочка, новогодняя ель, фильм «Ирония судьбы», новогодние подарки.\n" +
                                "\n" +
                                "Праздничный стол обилен и разнообразен. Неизменным блюдом праздника является салат «Оливье», главный новогодний фрукт – мандарины, а напиток – шампанское.";
                    case 2:
                        return "Новогодние каникулы! \uD83C\uDF84 ~Государственный праздник, выходной день. Новогодние каникулы продолжаются в среднем 8-10 дней, и заканчиваются после Рождественских праздников.\n" +
                                "\n" +
                                "Новый год отмечается всеми жителями страны в ночь с 31 декабря на 1 января. Традиции его празднования имеют давнюю историю. С 1992 года и 2 января также стало выходным, а с 2013-го в России новогодние каникулы увеличились до 8 дней (с 1 по 8 января).\n" +
                                "\n" +
                                "Новогодние символы российского Нового года – Дед Мороз, Снегурочка, новогодняя ель, фильм «Ирония судьбы», новогодние подарки.\n" +
                                "\n" +
                                "Праздничный стол обилен и разнообразен. Неизменным блюдом праздника является салат «Оливье», главный новогодний фрукт – мандарины, а напиток – шампанское.";
                    case 3:
                        return "Новогодние каникулы! \uD83C\uDF84 ~Государственный праздник, выходной день. Новогодние каникулы продолжаются в среднем 8-10 дней, и заканчиваются после Рождественских праздников.\n" +
                                "\n" +
                                "Новый год отмечается всеми жителями страны в ночь с 31 декабря на 1 января. Традиции его празднования имеют давнюю историю. С 1992 года и 2 января также стало выходным, а с 2013-го в России новогодние каникулы увеличились до 8 дней (с 1 по 8 января).\n" +
                                "\n" +
                                "Новогодние символы российского Нового года – Дед Мороз, Снегурочка, новогодняя ель, фильм «Ирония судьбы», новогодние подарки.\n" +
                                "\n" +
                                "Праздничный стол обилен и разнообразен. Неизменным блюдом праздника является салат «Оливье», главный новогодний фрукт – мандарины, а напиток – шампанское.";
                    case 4:
                        return "Новогодние каникулы! \uD83C\uDF84 ~Государственный праздник, выходной день. Новогодние каникулы продолжаются в среднем 8-10 дней, и заканчиваются после Рождественских праздников.\n" +
                                "\n" +
                                "Новый год отмечается всеми жителями страны в ночь с 31 декабря на 1 января. Традиции его празднования имеют давнюю историю. С 1992 года и 2 января также стало выходным, а с 2013-го в России новогодние каникулы увеличились до 8 дней (с 1 по 8 января).\n" +
                                "\n" +
                                "Новогодние символы российского Нового года – Дед Мороз, Снегурочка, новогодняя ель, фильм «Ирония судьбы», новогодние подарки.\n" +
                                "\n" +
                                "Праздничный стол обилен и разнообразен. Неизменным блюдом праздника является салат «Оливье», главный новогодний фрукт – мандарины, а напиток – шампанское.";
                    case 5:
                        return "Новогодние каникулы! \uD83C\uDF84 ~Государственный праздник, выходной день. Новогодние каникулы продолжаются в среднем 8-10 дней, и заканчиваются после Рождественских праздников.\n" +
                                "\n" +
                                "Новый год отмечается всеми жителями страны в ночь с 31 декабря на 1 января. Традиции его празднования имеют давнюю историю. С 1992 года и 2 января также стало выходным, а с 2013-го в России новогодние каникулы увеличились до 8 дней (с 1 по 8 января).\n" +
                                "\n" +
                                "Новогодние символы российского Нового года – Дед Мороз, Снегурочка, новогодняя ель, фильм «Ирония судьбы», новогодние подарки.\n" +
                                "\n" +
                                "Праздничный стол обилен и разнообразен. Неизменным блюдом праздника является салат «Оливье», главный новогодний фрукт – мандарины, а напиток – шампанское.";
                    case 6:
                        return "Новогодние каникулы! \uD83C\uDF84 ~Государственный праздник, выходной день. Новогодние каникулы продолжаются в среднем 8-10 дней, и заканчиваются после Рождественских праздников.\n" +
                                "\n" +
                                "Новый год отмечается всеми жителями страны в ночь с 31 декабря на 1 января. Традиции его празднования имеют давнюю историю. С 1992 года и 2 января также стало выходным, а с 2013-го в России новогодние каникулы увеличились до 8 дней (с 1 по 8 января).\n" +
                                "\n" +
                                "Новогодние символы российского Нового года – Дед Мороз, Снегурочка, новогодняя ель, фильм «Ирония судьбы», новогодние подарки.\n" +
                                "\n" +
                                "Праздничный стол обилен и разнообразен. Неизменным блюдом праздника является салат «Оливье», главный новогодний фрукт – мандарины, а напиток – шампанское.";
                    case 7:
                        return "Рождество Христово~" +
                                "Христианский праздник, связанный с памятью о рождении Иисуса Христа, утверждён согласно датировке празднования, принятой в Русской Православной Церкви.\n" +
                                "С 1991 года является нерабочим днём.\n" +
                                "\n" +
                                "Праздничные нерабочие дни являются общими на всей территории страны за исключением 7 января." +
                                "\n" +
                                "В субъектах РФ, основная часть населения которых исповедует религии, отличные от православного христианства, может устанавливаться вместо или наряду с 7 января другой праздничный день. " +
                                "В этом случае 7 января для граждан этих субъектов РФ может являться рабочим днём. " +
                                "Однако, на данный момент, ни в одном из субъектов РФ не отменён выходной день 7 января. Аналогичные полномочия предоставлены трудовым коллективам организаций для работников, исповедующих религии, отличные от православного христианства.";
                    case 8:
                        return "Новогодние каникулы! \uD83C\uDF84 ~Государственный праздник, выходной день. Новогодние каникулы продолжаются в среднем 8-10 дней, и заканчиваются после Рождественских праздников.\n" +
                                "\n" +
                                "Новый год отмечается всеми жителями страны в ночь с 31 декабря на 1 января. Традиции его празднования имеют давнюю историю. С 1992 года и 2 января также стало выходным, а с 2013-го в России новогодние каникулы увеличились до 8 дней (с 1 по 8 января).\n" +
                                "\n" +
                                "Новогодние символы российского Нового года – Дед Мороз, Снегурочка, новогодняя ель, фильм «Ирония судьбы», новогодние подарки.\n" +
                                "\n" +
                                "Праздничный стол обилен и разнообразен. Неизменным блюдом праздника является салат «Оливье», главный новогодний фрукт – мандарины, а напиток – шампанское.";
                    case 12:
                        return "День работника прокуратуры Российской Федерации \uD83D\uDC68\u200D⚖️~" +
                                "Праздник отмечается в России начиная с 1996 года, согласно Указу Президента Российской Федерации Бориса Николаевича Ельцина № 1329 от 29 декабря 1995 года.\n" +
                                "В этот день в 1722 году указом императора Российской империи Петра Великого при Правительствующем сенате впервые был учреждён пост генерал-прокурора и возник институт российской прокуратуры.";
                    case 13:
                        return "День российской печати \uD83D\uDCDC ~" +
                                "Учреждён постановлением Президиума Верховного совета РСФСР № 3043-1 от 28 декабря 1991 года и связан с исторической датой — началом издания первой российской печатной газеты «Ведомости» (не имеет отношения к современной одноимённой газете «Ведомости»), " +
                                "основанной указом Петра Великого. " +
                                "2 января 1703 года (13 января по новому стилю) в Москве вышел первый номер русскоязычной печатной газеты под сегодняшним названием «Санкт-Петербургские ведомости», который тогда назывался: " +
                                "«Ведомости о военных и иных делах, достойных знания и памяти, случившихся в Московском Государстве и во иных окрестных странах». " +
                                "Пётр Первый рассматривал газету как важное средство борьбы за проведение реформ и утверждения могущества Российской империи.";
                    case 14:
                        return "Старый Новый год!~" +
                                "Оставьте в прошлом старый год и насладитесь новым!";
                    case 21:
                        return "День инженерных войск~" +
                                "Установлен Указом Президента Российской Федерации Бориса Николаевича Ельцина № 1370 от 18 сентября 1996 года.";
                    case 25:
                        return "Татьянин день (День российского студенчества)! \uD83D\uDC68\u200D\uD83C\uDF93 ~" +
                                "После подписания в 1755 году императрицей Елизаветой Петровной указа об учреждении Московского университета, «Татьянин день» стал праздноваться сначала как день рождения университета, а позднее и как праздник российского студенчества.\n" +
                                "Указом Президента Российской Федерации Владимира Владимировича Путина № 76 от 25 января 2005 года с 2005 года праздник установлен официально. Выходной день в высших и средних специальных учебных заведениях.";
                    case 27:
                        return "День снятия блокады города Ленинграда~" +
                                "Блокада Ленинграда (ныне — Санкт-Петербург) — военная блокада немецкими, финскими и испанскими (Голубая дивизия) войсками с участием добровольцев из Северной Африки, " +
                                "Европы и военно-морских сил Италии во время Великой Отечественной войны. \n" +
                                "Длилась с 8 сентября 1941 года по 27 января 1944 года — 872 дня.";
                }
                return "";
            case 1:
                switch (i[1]) {
                    case 8:
                        return "Международный день стоматолога \uD83E\uDDB7 ~" +
                                "Профессиональный праздник стоматологов и зубных врачей, который отмечается по всей планете." +
                                "~del" +
                                "День российской науки~" +
                                "День российской науки — Этот праздник приурочен к дате основания Петербургской академии наук, учреждённой по повелению императора Петра I указом Сената от 28 января (8 февраля по новому стилю) 1724 года." +
                                "\n" +
                                "В СССР День науки отмечался в третье воскресенье апреля, так как в 1918 году между 18 и 25 апреля В.И. Ленин составил «Набросок плана научно-технических работ». До сегодняшних дней многие научные коллективы отмечают День науки «по старому стилю», то есть в третье воскресенье апреля (в 2022 году праздник выпадает на 17 апреля)." +
                                "\n" +
                                "С 1999 года День российской науки отмечается ежегодно 8 февраля, в соответствии с указом президента Российской Федерации от 7 июня 1999 года, «учитывая выдающуюся роль отечественной науки в развитии государства и общества, следуя историческим традициям и в ознаменование 275-летия со дня основания в России Академии наук».";
                    case 9:
                        return "День работника гражданской авиации \uD83D\uDEEB ~" +
                                "Установлен Указом Президента России Владимира Владимировича Путина от 9 февраля 2013 года № 98. Приурочен возникновению 9 февраля 1923 г. воздушного флота";
                    case 10:
                        return "День дипломатического работника \uD83D\uDCBC ~" +
                                "Профессиональный праздник всех дипломатических работников Российской Федерации, который отмечается в России ежегодно 10 февраля. " +
                                "Был учреждён Указом Президента Российской Федерации Владимира Владимировича Путина № 1279 от 31 октября 2002 года. Дата этого праздника связана с историей первого внешнеполитического " +
                                "ведомства России — Посольского приказа. " +
                                "На этот день 1549 года приходится наиболее раннее упоминание о нём.";
                    case 14:
                        return "День Святого Валентина (День всех влюблённых) \uD83D\uDC95 ~" +
                                "Праздник католического происхождения, который отмечается во многих странах мира." +
                                "Назван по имени одного из двух раннехристианских мучеников с именем Валентин.\n" +
                                "В этот день принято дарить всем Валентинки, ходить на свидания и признаваться в любви.";
                    case 15:
                        return "День памяти воинов-интернационалистов (День памяти о россиянах, исполнявших служебный долг за пределами Отечества)~" +
                                "Официальная памятная дата в Российской Федерации, призванная почтить память воинов-интернационалистов, исполнявших интернациональный долг за пределами границ своей Родины. " +
                                "Установлен федеральным законом от 29.11.2010 г. № 320-ФЗ. В этот день, 15 февраля 1989 года, последняя колонна советских войск покинула территорию Афганистана. Командующий " +
                                "Ограниченным контингентом генерал-лейтенант Борис Всеволодович Громов, спрыгнув с бронетранспортёра, пересёк мост, символизируя этим, что он последним перешёл пограничную реку Амударья (г. Термез), " +
                                "но в реальности последними Афганистан покинули подразделения пограничников и спецназа, прикрывавшие вывод войск и вышедшие на территорию СССР только во второй половине дня 15 февраля. " +
                                "Это событие ознаменовало для Советского Союза окончание Афганской войны, которая продлилась почти десять лет и унесла жизни более 15 тысяч советских граждан.";
                    case 23:
                        return "День защитника Отечества \uD83D\uDCAA ~" +
                                "История этого праздника начинается со дня победы Красной Армии над кайзеровскими войсками Германии в 1918 году. В этот день отряды формирующейся Красной Армии остановили врага на подступах к Петрограду." +
                                "С 2002 года является нерабочим днём. В 2013—2014 и 2019 годах существовала практика при совпадении этого праздника с выходным днём переносить выходной не на ближайший понедельник (как это предусмотрено ТК РФ), а на другой рабочий день.";
                    case 27:
                        return "День Сил специальных операций~" + "" +
                                "Установлен Указом Президента России Владимира Владимировича Путина № 103 от 26 февраля 2015 года.";
                }
                return "";
            case 2:
                switch (i[1]) {
                    case 8:
                        return "Международный женский день~Праздник появился как день солидарности женщин в борьбе за равные права и эмансипацию.";
                    case 9:
                        return "День работников геодезии и картографии~В марте произошли важные события для российской геодезии и картографии. В марте 1720 года Пётр I подписал указ, положивший начало картографической съёмке в России. " +
                                "15 марта 1919 года Советом Народных Комиссаров РСФСР был подписан Декрет «Об учреждении Высшего геодезического управления» (ВГУ) при Научно-техническом отделе Высшего совета народного хозяйства РСФСР.";
                    case 11:
                        return "День работника органов наркоконтроля~Праздник приурочен к появлению 11 марта 2003 года Государственного комитета РФ по контролю за оборотом наркотических средств и психотропных веществ.";
                    case 12:
                        return "День работников уголовно-исполнительной системы Минюста~Профессиональный праздник работников уголовно-исполнительной системы Российской Федерации. Введён Указом Президента России Дмитрия Анатольевича Медведева № 1433 от 16 ноября 2010 года. В этот день, " +
                                "12 марта 1879 года, российский император Александр II издал указ о создании тюремного департамента.";
                    case 14:
                        return "День работников торговли, бытового обслуживания населения и жилищно-коммунального хозяйства~Профессиональный праздник работников, занятых в торговле (в том числе розничной), тружеников сферы услуг, а также трудящихся, чьи специальности непосредственно связаны с ЖКХ.";
                    case 18:
                        return "День воссоединения Крыма с Россией~18 марта в Российской Федерации отмечается День воссоединения Крыма с Россией. На территории Республики Крым этот день является праздничным и выходным согласно республиканскому закону №80-ЗРК/2015 от 3 марта 2015 года.\n" +
                                "\n" +
                                "Именно в этот день в 2014 году Крым (это территории полуострова Крым с расположенными на ней Республикой Крым и городом Севастополем, которые до этого входили в состав Украины) официально вошёл в состав Российской Федерации. Присоединение, а вернее – возвращение, этих территорий в состав России было зафиксировано межгосударственным договором, подписанным 18 марта 2014 года в Георгиевском зале Большого Кремлевского дворца в Москве главами России и Республики Крым. Причем, согласно данному документу Республика Крым и город Севастополь были не просто приняты в состав РФ, но и стали ее новыми субъектами.";
                    case 19:
                        return "День моряка-подводника~Праздник, который отмечается военнослужащими, ветеранами и гражданским персоналом подводных сил Военно-Морского Флота Российской Федерации. \n6 (19) марта 1906 года по указу императора Российской империи Николая II в классификацию судов военного флота был включен новый класс боевых кораблей — подводные лодки, а в состав Российского флота включены " +
                                "20 подводных лодок «Форель», а также построенные к тому времени субмарины типов «Касатка», «Сом» и «Осётр».";
                    case 27:
                        return "День войск национальной гвардии Российской Федерации~Профессиональный праздник военнослужащих, сотрудников имеющих специальные звания полиции и гражданского персонала Войск национальной гвардии Российской Федерации.\n" +
                                "Изначально в этот день отмечался День внутренних войск МВД России, который был установлен Указом Президента России Бориса Николаевича Ельцина № 394 от 19 марта 1996 года. Он являлся профессиональным праздником всех военнослужащих и гражданского персонала внутренних войск Министерства внутренних дел Российской Федерации. Был нерабочим днём для военнослужащих и гражданского персонала внутренних войск. " +
                                "Указом Президента России Владимира Владимировича Путина № 10 от 16 января 2017 года День внутренних войск МВД РФ был отменён, а вместо него установлен День войск национальной гвардии РФ.";
                    case 29:
                        return "День специалиста юридической службы \uD83D\uDC68\u200D⚖ ~Профессиональный праздник юристов (военнослужащих и гражданского персонала) в Вооружённых Силах Российской Федерации. Был установлен Указом президента России Владимира Владимировича Путина № 549 от 31 мая 2006 года. " +
                                "В указе также сказано, что праздник устанавливается «в целях возрождения и развития отечественных воинских традиций, повышения престижа военной службы и в знак признания заслуг военных специалистов в решении задач обеспечения обороны и безопасности государства».";
                }
                return "";
            case 3:
                switch (i[1]) {
                    case 1:
                        return "День смеха \uD83E\uDD23\uD83D\uDE02~Всемирный праздник, отмечаемый во многих странах. Во время этого праздника принято разыгрывать друзей и знакомых, или просто подшучивать над ними.\n" +
                                "Традиционно в таких странах, как Новая Зеландия, Ирландия, Великобритания, Австралия и Южная Африка, розыгрыши устраиваются только до полудня, называя тех, кто шутит после этого времени, «апрельскими дураками».";
                    case 2:
                        return "День единения народов~Отмечается 2 апреля в связи с тем, что в этот день в 1996 году был подписан договор о создании сообщества Беларуси и России. Через год в этот же день был подписан договор о Союзе Беларуси и России.";
                    case 4:
                        return "День геолога~Профессиональный праздник специалистов связанных с геологическими науками и специальностями. Праздновался c 1966 года в СССР, и продолжает отмечаться в России и некоторых странах бывшего СССР.";
                    case 8:
                        return "День сотрудников военных коммиссариатов~День принятия «Декрета об учреждении волостных, уездных, губернских и окружных комиссариатов по военным делам» отмечается в Российской Федерации, а также в Беларуси как профессиональный праздник.";
                    case 12:
                        return "День космонавтики \uD83D\uDC7D~Отмечаемая в России дата, установленная в ознаменование первого полёта человека в космос.\n" +
                                "12 апреля 1961 года советский космонавт Юрий Гагарин на космическом корабле «Восток-1» стартовал с космодрома «Байконур» и впервые в мире совершил орбитальный облёт планеты Земля. Полёт в околоземном космическом пространстве продлился 1 час 48 минут.\n" +
                                "\n" +
                                "Установлен Указом Президиума Верховного Совета СССР № 3018-Х от 1 октября 1980 года.";
                    case 26:
                        return "День памяти погибших в радиационных авариях и катастрофах~Ежегодно отмечается в память о событиях 26 апреля 1986 года на Чернобыльской АЭС.\n" +
                                "В этот день на Чернобыльской атомной электростанции произошла крупнейшая в мире техногенная катастрофа. Было выброшено в атмосферу около 190 тонн радиоактивных веществ. Опасные радиоактивные вещества выделялись в окружающую среду из-за пожара, длившегося почти две недели. " +
                                "Население Чернобыля подверглось облучению в 90 раз большему, чем население Хиросимы после взрыва атомной бомбы.";
                    case 27:
                        return "День российского парламентаризма~Эта дата является днём начала работы в 1906 году Государственной Думы — первого в отечественной истории демократического института, заложившего основы парламентаризма в России.\n" +
                                "Праздник призван способствовать привлечению внимания широких слоёв населения к деятельности Федерального Собрания Российской Федерации и законодательных органов государственной власти субъектов Российской Федерации, популяризации этой деятельности.";
                    case 28:
                        return "День работника скорой медицинской помощи \uD83D\uDC69\u200D⚕️ ~Скорая медицинская помощь — вид медицинской помощи, оказываемой гражданам при заболеваниях, несчастных случаях, травмах, отравлениях и других состояниях, требующих срочного медицинского вмешательства.\n" +
                                "Праздник был установлен во время пандемии COVID-19 в качестве благодарности за труд работников скорой медицинской помощи в непростое время.";
                    case 30:
                        return "День пожарной охраны \uD83D\uDC68\u200D\uD83D\uDE92~Профессиональный праздник работников пожарной охраны. Отмечается в Российской Федерации ежегодно.";
                }
                return "";
            case 4:
                switch (i[1]) {
                    case 1:
                        return "Праздник Весны и Труда~Праздник появился в СССР и был праздником рабочих, которые, согласно Ленину, в этот день праздновали «своё пробуждение к свету и знанию, своё объединение в один братский союз для борьбы против всякого угнетения, " +
                                "<…> за социалистическое устройство общества». В нынешней России праздник утратил свой изначальный политический характер. Согласно оценкам некоторых СМИ, для большинства граждан страны этот день — всего лишь повод для развлечений, дополнительный выходной и начало дачно-огородного сезона.\n" +
                                "С 1918 года является нерабочим днём; до 1992 года носил название «День международной солидарности трудящихся»; до 2005 года также и 2 мая было выходным; " +
                                "начиная с 2013 года, после увеличения новогодних каникул, появилась практика переноса выходных дней с январских праздников на 1 или 2 рабочих дня в промежутке со 2 по 5 мая (кроме 2017 и 2021 года), в связи с чем продолжительность выходных стала достигать 4—5 дней.";
                    case 7:
                        return "День радио, праздник работников всех отраслей связи \uD83D\uDCFB ~Праздник (в СССР и России) работников всех отраслей связи и радиотехники (профессиональный праздник).\n" +
                                "Отмечается 7 мая, потому что в этот день в 1895 году российский физик Александр Попов, на заседании физико-химического общества, продемонстрировал беспроводную удалённую регистрацию электромагнитных колебаний от разряда молнии на элементарный приёмник собранный им. Впервые эта дата была торжественно отмечена в СССР в 1925 году, а с 1945 праздник отмечается ежегодно.";
                    case 9:
                        return "День Победы~День Победы СССР и его союзников над нацистской Германией в Великой Отечественной войне 1941—1945 годов (1945 год); нерабочий в 1945—1947 годах и с 1965 года.\n" +
                                "В День Победы во многих городах России проводятся военные парады и праздничные салюты, в Москве производится организованное шествие к Могиле Неизвестного Солдата с церемонией возложения венков, в крупных городах — праздничные шествия и фейерверки.\n" +
                                "\n" +
                                "В 2010-е годы широкое распространение получили шествия с портретами ветеранов — «Бессмертный полк».";
                    case 20:
                        return "Всемирный день метрологии~Международный профессиональный праздник. Учреждён Международным Комитетом мер и весов (МКМВ) в октябре 1999 года, на 88-м заседании Комитета.";
                    case 21:
                        return "День полярника~Профессиональный праздник, установленный указом Президента Российской Федерации в 2013 году в знак признания заслуг полярников. Выбор даты связан с датой открытия 21 мая 1937 года первой дрейфующей полярной станции «Северный полюс-1».";
                    case 24:
                        return "День кадрового работника~Неофициальный профессиональный праздник работников отделов кадров в Российской Федерации. Эта дата установлена в честь того, что в этот день, 24 мая 1835 года, в Российской империи вышло правительственное постановление «Об отношении между хозяевами фабричных заведений и рабочими людьми, поступающими на оные по найму». Этот документ впервые в российском государстве регламентировал отношения наёмных работников и их работодателя.";
                    case 25:
                        return "День филолога~Профессиональный праздник людей, посвятивших свою жизнь филологии. В России праздник отмечают вслед за Днём славянской письменности и культуры. Праздник отмечается и в ряде других стран. Этот праздник объединяет лингвистов, литературоведов, учителей и преподавателей в области языка и литературы, библиотекарей, переводчиков-филологов и всех, кто имеет филологическое образование.\n" +
                                "Сама наука филоло́гия (от греч. φιλολογία, «любовь к слову») — название группы дисциплин (лингвистика, литературоведение, текстология и др.), изучающих письменные тексты и на основе стилистического, языкового и содержательного анализа — историю и сущность духовной культуры данного общества.";
                    case 26:
                        return "День российского предпринимательства \uD83D\uDCB8 ~Профессиональный праздник, введённый в 2007 году. В рамках праздника проходят выставки, презентации компаний-участниц, обучающие семинары и консультации, тренинги, круглые столы и другие мероприятия.";
                    case 27:
                        return "Общероссийский день библиотек \uD83D\uDCDA ~Профессиональный праздник работников российских библиотек. Установлен 27 мая 1995 года Указом президента Российской Федерации Бориса Николаевича Ельцина №539 по инициативе директора Российской национальной библиотеки, президента Российской библиотечной ассоциации Владимира Николаевича Зайцева. В этот день, в 1795 году была основана первая государственная общедоступная библиотека России — Императорская публичная библиотека, ныне Российская национальная библиотека.";
                    case 28:
                        return "День пограничника~Профессиональный праздник личного состава Пограничных войск КГБ СССР. Эту традицию по сей день чтут пограничники в странах СНГ.";
                    case 29:
                        return "День военного автомобилиста~Профессиональный праздник военнослужащих и гражданского персонала автомобильных войск Российской Федерации, а также всех тех военнослужащих и военнообязанных, кому по долгу службы приходится или приходилось управлять теми или иными транспортными средствами.";
                    case 31:
                        return "День российской адвокатуры~Неофициальный профессиональный праздник работников адвокатуры — социального института занимающегося защитой интересов в суде.\n" +
                                "В апреле 2005 года в Москве состоялся Второй Всероссийский съезд адвокатов. В принятой на съезде резолюции № 4 говорилось, что Всероссийский съезд адвокатов считает необходимым: в ознаменование даты принятия Федерального закона «Об адвокатской деятельности и адвокатуре в Российской Федерации» учредить 31 мая праздник: «День российской адвокатуры».";
                }
                return "";
            case 5:
                switch (i[1]) {
                    case 1:
                        return "Международный день защиты детей~Учреждён в ноябре 1949 года в Париже решением конгресса Международной демократической федерации женщин, впервые отмечался в 1950 году.";
                    case 2:
                        return "День спутникового мониторинга и навигации~Эта дата является днём рождения космодрома Байконур, с которого был запущен первый искусственный спутник Земли.";
                    case 5:
                        return "День эколога \uD83C\uDF0D ~Профессиональный праздник всех российских защитников природы, специалистов по охране окружающей среды, общественных деятелей и экологов-активистов. Отмечается ежегодно 5 июня, во Всемирный день окружающей среды.";
                    case 6:
                        return "День русского языка\uD83C\uDDF7\uD83C\uDDFA~Идею учреждения Дня русского языка впервые высказал автор проекта «Русская игра слов» Иван Клименко на страницах «Парламентской газеты» 26 декабря 2007 года. В своей статье автор, подводя итоги Года русского языка, отмечает: «…опыт именного Года свидетельствует о том, что для непременного развития языка в каждом грядущем календарном году обязательно должен ещё быть и один именной День. День русского языка. Всемирный праздник для всего Русского мира». Но ни законодательная, ни исполнительная власти России на предложение не отреагировали." +
                                "\n" +
                                "Ещё раньше, в 1996 году, День защиты русского языка 6 июня, в день рождения А.С.Пушкина, начала праздновать Русская община Крыма. Начиная с 2007 года в Крыму по их инициативе 6 июня стал проводиться Международный фестиваль русской, славянской культуры «Великое Русское Слово». Именно в этот день участников фестиваля на протяжении многих лет поздравляет Президент Российской Федерации." +
                                "\n" +
                                "6 июня 2011 года Президентом Российской Федерации Д.А.Медведевым подписан указ: «Установить День русского языка и отмечать его ежегодно, 6 июня, в день рождения великого русского поэта, основоположника современного русского литературного языка А.С.Пушкина».";
                    case 8:
                        return "День социального работника~Профессиональный праздник работников сферы социальной защиты населения.\n" +
                                "В этот день, 8 июня 1701 года в российской Империи Петр Первый (Великий) издал царский Указ № 1856 «Об определении в домовых Святейшего Патриархата богадельни нищих, больных и престарелых». Согласно указу, «для десяти человек больных — в богадельне должен быть один здоровый, " +
                                "который бы за теми больными ходил и всякое им вспоможение чинил».";
                    case 12:
                        return "День России \uD83C\uDDF7\uD83C\uDDFA~12 июня 1990 года на первом съезде народных депутатов РСФСР была принята Декларация о государственном суверенитете РСФСР.\n" +
                                "С 1992 года является нерабочим днём; до 2002 года носил название «День принятия Декларации о государственном суверенитете Российской Федерации».";
                    case 14:
                        return "День работников миграционной службы~Профессиональный праздник работников Федеральной миграционной службы МВД.\n" +
                                "Праздник появился в календаре официальных российских профессиональных праздников в 2007 году, после того, как 6 мая 2007 года президент России В. В. Путин к пятнадцатилетнему " +
                                "юбилею Федеральной миграционной службы подписал Указ «Об установлении Дня работника миграционной службы»";
                    case 20:
                        return "День медицинского работника \uD83D\uDC68\u200D⚕  ~День медицинского работника отмечался в СССР на основании Указа Президиума Верховного Совета СССР от 1 октября 1980 года «О праздничных и памятных днях».";
                    case 22:
                        return "День памяти и скорби — день начала Великой Отечественной войны~Отмечается в России, Белоруссии («День всенародной памяти жертв Великой Отечественной войны») и на Украине («День скорби и чествования памяти жертв войны»), в ознаменование годовщины (1941) начала Великой Отечественной войны, когда войска стран «оси» вторглись на территорию СССР.";
                    case 26:
                        return "День изобретателя и рационализатора~Указом Президиума Верховного Совета СССР от 24 января 1979 года этот праздник получил в Советском Союзе официальный статус и последняя суббота июня месяца была закреплена как «Всесоюзный день изобретателя и рационализатора».";
                    case 27:
                        return "День молодёжи~История этого праздника началась 7 февраля 1958 году в Советском Союзе, когда Указом Президиума Верховного Совета СССР «Об установлении Дня советской молодёжи» был учреждён «День советской молодёжи», который отмечался в последнее воскресенье июня.";
                    case 30:
                        return "День экономиста \uD83D\uDCB2~Неофициальный профессиональный праздник финансовых работников.";
                }
                return "";
            case 6:
                switch (i[1]) {
                    case 3:
                        return "День ГАИ (ГИБДД МВД РФ)~Государственная автомобильная инспекция МВД СССР была образована 3 июля 1936 года. Именно тогда постановлением Совета народных комиссаров было утверждено «Положение о Государственной автомобильной инспекции Главного управления рабоче-крестьянской милиции НКВД CCCP».";
                    case 4:
                        return "День работников морского и речного флота~Профессиональный праздник работников морского и речного флота.";
                    case 8:
                        return "День семьи, любви и верности~День памяти святых Петра и Февронии в Русской православной церкви, покровителей семьи и брака.\n" +
                                "В народном календаре восточных славян — день первого покоса. С этого дня обычно снимались запреты на заготовку трав и купание — считалось, что в этот день последние русалки уходят с берегов в глубь водоёмов, поэтому купаться уже было безопасно.\n" +
                                "\n" +
                                "С 2008 года в России отмечают приуроченный ко Дню Петра и Февронии День семьи, любви и верности.";
                    case 11:
                        return "День рыбака~Профессиональный праздник рыбаков. Учреждён Указом Президиума Верховного Совета СССР от 3 мая 1965 года № 3519-VI. Праздник официально отмечается в России и на Украине с 12 июля 1965 года; неофициально и в других странах бывшего СССР.";
                    case 17:
                        return "День этнографа~Профессиональный праздник представителей различных этнографических школ.";
                    case 18:
                        return "День металлурга~Установлен Указом Верховного Совета СССР от 1 октября 1980 года Этот праздник широко отмечается в городах, где построены металлургические предприятия (Старый Оскол, Норильск, Новокузнецк, Магнитогорск, Череповец, Челябинск, Таганрог, Липецк, Мончегорск и др.).";
                    case 25:
                        return "День сотрудника органов следствия Российской Федерации~Профессиональный праздник сотрудников и работников Следственного комитета Российской Федерации, сотрудников и работников следственных подразделений Министерства внутренних дел и Федеральной службы безопасности Российской Федерации.\n" +
                                "В этот день в 1713 году был издан именной указ Петра I «О создании следственной канцелярии гвардии майора М.И. Волконского», руководителем которой назначен гвардии майор Семеновского полка Михаил Иванович Волконский. Названная «майорская» следственная канцелярия, как установил доктор исторических наук Серов Дмитрий Олегович, явилась первым государственным органом России, подчинённым непосредственно главе государства и наделённым полномочиями по проведению предварительного следствия.";
                    case 28:
                        return "День крещения Руси~Отмечается как день памяти святого равноапостольного великого князя Владимира — крестителя Руси (15 июля по юлианскому календарю).\n" +
                                "\n" +
                                "День крещения Руси закреплён в законодательстве Российской Федерации «в качестве памятной даты важного исторического события, оказавшего значительное влияние на общественное, духовное и культурное развитие народов России и на укрепление российской государственности».";
                    case 30:
                        return "День системного администратора~Праздник, который отмечается с целью выражения признательности сотрудникам, выполняющим обязанности системных администраторов. В американском варианте — День благодарности системному администратору.";


                }
                return "";
            case 7:
                switch (i[1]) {
                    case 2:
                        return "День Воздушно-десантных войск~Днём рождения ВДВ считается 2 августа 1930 года. В этот день на учениях Московского военного округа под Воронежем впервые было десантировано на парашютах десантное подразделение в количестве 12 человек для выполнения тактической задачи. Отмечается на основании " +
                                "Указа Президента Российской Федерации от 31 мая 2006 года № 549 в знак признания заслуг военных специалистов в решении задач обеспечения обороны и безопасности государства.";
                    case 6:
                        return "День железнодорожных войск~Профессиональный праздник военнослужащих, военнообязанных, рабочих и служащих (гражданский контингент) Железнодорожных войск Российской Федерации (ЖДВ ВС России).";
                    case 8:
                        return "День железнодорожника \uD83D\uDE84~Профессиональный праздник, в который отмечаются профессиональные заслуги работников железнодорожного транспорта и достижения отрасли.\n" +
                                "Празднуется в Российской Федерации, Белоруссии, Казахстане, Киргизии, Узбекистане и Болгарии.";
                    case 12:
                        return "День Военно-воздушных сил~Памятный день Военно-воздушных сил в Вооружённых силах Российской Федерации.";
                    case 15:
                        return "День строителя \uD83C\uDFD7️/День археолога~1)Профессиональный праздник работников строительной отрасли. Отмечается в России и некоторых других странах, являющихся бывшими республиками Советского Союза \n\n" +
                                "2)Неофициальный профессиональный праздник археологов России, Белоруссии и Казахстана, официальный праздник на Украине (с 2008 года). Обычно в этот день проводится «посвящение в археологи».";
                    case 18:
                        return "День географа~В этот день в 1845 году было основано Русское географическое общество.";
                    case 22:
                        return "День Воздушного Флота России/День Государственного флага Российской Федерации \uD83C\uDDF7\uD83C\uDDFA ~1)Профессиональный праздник пилотов воздушного флота и работников авиационной инфраструктуры России.\n\n" +
                                "2)Профессиональный праздник пилотов воздушного флота и работников авиационной инфраструктуры России.";
                    case 27:
                        return "День кино \uD83D\uDCFD  \uD83C\uDFAC~Профессиональный праздник кинематографистов и любителей кинематографа в Российской Федерации.";
                    case 29:
                        return "День шахтёра~Профессиональный праздник шахтёров, история которого началась во времена Советского Союза; после распада СССР по-прежнему отмечается в России, Белоруссии, Эстонии, Узбекистане, Казахстане и на Украине.";
                    case 31:
                        return "День ветеринарного работника \uD83D\uDC08\u200D~Национальный профессиональный праздник работников ветеринарии (от врачей до уборщиков помещений в ветлечебницах).";
                }
                return "";
            case 8:
                switch (i[1]) {
                    case 1:
                        return "День знаний \uD83C\uDF93~1 сентября — начало нового учебного года для подавляющего большинства российских школьников, студентов, учителей и преподавателей. Традиционно в " +
                                "этот день в школах проходят торжественные линейки, классные часы, уроки знаний, мира, безопасности и мужества и т. д.";
                    case 3:
                        return "День солидарности в борьбе с терроризмом~Был установлен в соответствии с федеральным законом Российской Федерации «О днях воинской славы (победных днях) России» в редакции от 21 июля 2005 года. Она напрямую связана с событиями в Беслане 1—3 сентября 2004 года: захватом заложников в школе № 1 города Беслана (Северная Осетия), совершённым террористами утром 1 сентября 2004 года во время торжественной линейки, посвящённой началу учебного года. В течение двух с половиной дней террористы удерживали в заминированном здании более 1100 заложников (преимущественно детей, их родителей и сотрудников школы) в тяжелейших условиях, отказывая людям даже в удовлетворении минимальных естественных потребностей.\n" +
                                "В день солидарности в борьбе с терроризмом не только в Беслане, но и по всей стране вспоминают жертв террористических актов, а также сотрудников правоохранительных органов, погибших при выполнении служебного долга.";
                    case 4:
                        return "День специалиста по ядерному обеспечению~Празднуется в годовщину создания (в 1947 году) Специального отдела при Генеральном штабе ВС СССР, на который было возложено руководство проведением испытаний ядерного оружия. В настоящее время основная функция 12-го Главного управления МО РФ — обеспечивать хранение, эксплуатацию и защиту ядерного боезапаса РФ.";
                    case 5:
                        return "День работников нефтяной и газовой промышленности~Профессиональный праздник работников нефтяной и газовой промышленности. Праздник был учреждён Президиумом Верховного Совета СССР 28 августа 1965 года в ознаменование успешного освоения нефтегазового потенциала Западной Сибири, а также отмечавшегося в 1964 году столетия отечественной нефтяной и газовой промышленности.";
                    case 8:
                        return "День финансиста \uD83D\uDCB8~Официальный профессиональный праздник в России, отмечаемый начиная с 2011 года. Ранее в этот день праздник отмечался неофициально в честь того, что 8 сентября 1802 года манифестом императора Александра I было учреждено Министерство финансов Российской империи.";
                    case 9:
                        return "День тестировщика~Профессиональный день тестировщиков.\n" +
                                "По легенде, 9 сентября 1947 года учёные Гарвардского университета, тестировавшие вычислительную машину Mark II Aiken Relay Calculator, нашли мотылька, застрявшего между контактами электромеханического реле, и Грейс Хоппер произнесла слово «bug» (англ. «жук»), ставшее позднее термином, обозначающим компьютерную ошибку. Извлечённое насекомое было вклеено в технический дневник с сопроводительной надписью: «First actual case of bug being found» (англ. «первый случай в практике, когда был обнаружен жучок»). Этот забавный факт положил начало использованию слова «баг» в значении «ошибка». В итоге процесс выявления и устранения причин сбоя в работе компьютера получил название debugging (дебаггинг, «отладка», дословно: избавление от жуков). А само название профессии возникло от английского слова test, то есть испытание.";
                    case 12:
                        return "День танкиста~Советский, российский, белорусский и украинский профессиональный праздник танкистов и танкостроителей.\n" +
                                "Праздник был учреждён в СССР Указом Президиума Верховного Совета СССР от 11 июля 1946 года в ознаменование больших заслуг бронетанковых и механизированных войск в разгроме противника в годы Великой Отечественной войны, а также за заслуги танкостроителей в оснащении Вооружённых Сил страны бронетанковой техникой. С момента учреждения до 1980 года отмечался 11 сентября, в знак того, что в этот день в 1944 году советские войска добились серьёзных успехов во время проведения Восточно-Карпатской операции. В 1980 году Указом Президиума Верховного Совета СССР был установлен новый порядок празднования: праздник не имеет фиксированной даты и отмечается во второе воскресенье сентября.";
                    case 13:
                        return "День программиста \uD83D\uDC68\u200D\uD83D\uDCBB~Праздник программистов, отмечаемый в 256-й день года. Число 256 (28) выбрано потому, что это количество различных значений, которые можно выразить с помощью восьмиразрядного байта. Также это максимальная целая степень числа 2, которая не превышает количества дней в году (365 или 366).\n" +
                                "В невисокосный год данный праздник выпадает на 13 сентября, в високосный — на 12 сентября.";
                    case 19:
                        return "День оружейника~Профессиональный праздник работников российской оборонной промышленности, отмечается начиная с 2012 года. Установлен указом президента Российской Федерации от 3 декабря 2011 года № 1578.\n" +
                                "Дата празднования выбрана в честь дня почитания православной церковью архангела Михаила, как покровителя небесного воинства.\n" +
                                "Дата празднования выбрана в честь дня почитания православной церковью архангела Михаила, как покровителя небесного воинства.";
                    case 24:
                        return "День системного аналитика~Празднуется в России, США и других странах мира.";
                    case 26:
                        return "День машиностроителя~Отмечается в России и Белоруссии (отмечался в СССР), на Украине отмечается в четвёртое воскресенье сентября.\n" +
                                "День машиностроителя отмечается в России на основании Указа Президиума Верховного Совета СССР от 1 октября 1980 года «О праздничных и памятных днях». Этот профессиональный праздник отмечают рабочие и инженеры машиностроительной отрасли.";
                    case 27:
                        return "Всемирный день туризма \uD83E\uDDF3~Международный праздник, учреждённый Генеральной ассамблеей Всемирной туристской организации в 1979 году в испанском городе Торремолинос. В России отмечается с 1983 года.\n" +
                                "Цель праздника — пропаганда туризма, освещение его вклада в экономику мирового сообщества, развитие связей между народами разных стран.";
                    case 28:
                        return "День работника атомной промышленности~Профессиональный праздник всех работников атомной промышленности Российской Федерации. В этот день, 28 сентября 1942 года Государственный комитет обороны СССР выпустил распоряжение «Об организации работ по урану».";
                    case 30:
                        return "День переводчика~Профессиональный праздник устных и письменных переводчиков. Отмечается в день смерти в 419 или 420 году Св. Иеронима Стридонского, который осуществил полный перевод Библии на латинский язык (итогом чего стало появление так называемой «Вульгаты») в связи с чем традиционно считается святым покровителем переводчиков. Праздник официально учреждён Международной федерацией переводчиков (FIT) в 1991 году. Популярность этого праздника растёт с каждым годом.";
                }
                return "";
            case 9:
                switch (i[1]) {
                    case 1:
                        return "День пожилых людей~Отмечается начиная с 1991 года. Был провозглашён на 45-й сессии Генеральной Ассамблеи ООН (Резолюция № A/RES/45/106 от 14 декабря 1990 года) под названием «Международный день престарелых». В дальнейшем в русскоязычных документах ООН было принято название «Международный день пожилых людей».";
                    case 4:
                        return "День космических войск~Праздник, отмечаемый в Космических войсках России. Приурочен ко дню запуска первого искусственного спутника Земли, открывшего в 1957 году летопись космонавтики, в том числе и военной.";
                    case 5:
                        return "День учителя \uD83D\uDCD0~Профессиональный праздник работников сферы образования.\n" +
                                "Обычно в этот день учителя принимают поздравления от своих воспитанников, которые дарят им букеты цветов и делают подарки, устраивают концерты, рисуют красочные стенгазеты и, по традиции, проводят день самоуправления.";
                    case 6:
                        return "День российского страховщика~Профессиональный праздник работников страховых компаний России. Многие страховщики игнорируют эту дату, считая её скорее корпоративным праздником Росгосстраха. Более того, регулярно поступают предложения официально ввести в качестве дня страховщика другие даты.";
                    case 16:
                        return "День отца~Ежегодный праздник в честь отцов, отмечаемый во многих странах. В России День отца отмечается с 2021 года в третье воскресенье октября.";
                    case 20:
                        return "День военного связиста~Профессиональный праздник российских военных связистов: военнослужащих и гражданских служащих подразделений связи во всех родах войск России и во всех Службах связи во всех видах вооружённых сил России. А также профессиональный праздник непосредственно Войск связи России. Праздник приурочен к дню образования специальных войск связи России — 20 октября 1919 года. Хотя подразделения связи в войсках России существуют ещё с со второй половины XIX века.";
                    case 23:
                        return "День работников рекламы~Неофициальный профессиональный праздник всех тех, кто так или иначе связан с рекламным бизнесом в Российской Федерации: создателей рекламы, маркетологов, пиарщиков, креативщиков.";
                    case 24:
                        return "День подразделений специального назначения~Профессиональный праздник военнослужащих подразделений специального назначения Вооружённых Сил России.\n" +
                                "В этот день в 1950 году министр Вооружённых сил СССР и Военный министр СССР, маршал Советского Союза А. М. Василевский подписал директиву № ОРГ/2/395/832 с грифом «Секретно» о создании подразделений специального назначения (СпН) (глубинная разведка или разведка специального назначения) для действий в самом глубоком тылу вероятного противника, в которой предписывалось в кратчайшие сроки (до 1 мая 1951 года) сформировать в вооружённых силах страны 46 рот СпН со штатом в 120 человек в каждой, во всех военных округах, группах войск и флотах. Приказ был выполнен и в Первомай 1951 года ВС СССР уже имели в своём составе подразделения СпН численностью более пяти с половиной тысяч человек. Именно день подписания директивы Василевским и стал знаменательной датой. Стоит заметить, что части специального назначения существовали в русской армии и до 1917 г. Это была Отдельная Морская бригада особого назначения (ОМБОН), сформированная 31 мая 1916 г. в составе Минного и Артиллерийского полков особого назначения и Речной флотилии особого назначения. Эти части были укомплектованы офицерами ВМФ и принимали участие в боевых действиях на Западном фронте до начала 1918 г., после чего были расформированы. Таким образом, днём рождения «старого» русского спецназа является 31 мая.";
                    case 25:
                        return "День таможенника Российской Федерации~Государственный профессиональный праздник всех работников таможни Российской Федерации.\n" +
                                "25 октября в 1653 года в Русском царстве впервые появился Единый таможенный устав, родившийся из указа царя Алексея Михайловича Романова о взимании таможенной пошлины «в Москве и городах российских».";
                    case 29:
                        return "День вневедомственной охраны~Профессиональный праздник сотрудников структурного подразделения Федеральной службы войск национальной гвардии Российской Федерации, предоставляющего услуги по охране объектов всех форм собственности, а также квартир и других мест хранения личного имущества граждан.";
                    case 30:
                        return "День памяти жертв политических репрессий~Памятный день, в который проходят траурные акции и памятные мероприятия (митинги, возложения венков и цветов к памятникам репрессированным, «уроки памяти» в учебных заведениях и пр.), посвящённые памяти людей, погибших и пострадавших в ходе политических репрессий.";
                    case 31:
                        return "День работников СИЗО и тюрем/День автомобилиста \uD83D\uDE97~1)В этот день в 1963 году Коллегия министерства охраны общественного порядка РСФСР приняла решение о создании в Советском Союзе следственных изоляторов, как нового вида учреждений уголовно-исполнительной системы.\n" +
                                "Профессиональный праздник всех работников следственных изоляторов (СИЗО) и тюрем в Российской Федерации.\n\n" +
                                "2)Профессиональный праздник работников автомобильного транспорта.\n" +
                                "История этого профессионального праздника начинается с издания Указа Президиума Верховного Совета СССР от 15 января 1976 г. № 2847-IX об установлении «Дня работников автомобильного транспорта», затем он был подтверждён 1 октября 1980 года, когда Президиум Верховного Совета Союза Советских Социалистических Республик издал Указ № 3018-Х «О праздничных и памятных днях», который, в числе прочего, предписывал учредить в СССР в последнее воскресенье октября «День автомобилиста» (который был более известен как «День водителя»).";
                }
                return "";
            case 10:
                switch (i[1]) {
                    case 1:
                        return "День менеджера/День судебного пристава Российской Федерации~1)Профессиональный праздник специалистов, которые имеют отношение к управленческой деятельности, вне зависимости от занимаемой должности и выслуги лет. Среди них руководители младшего, среднего и высшего звена, офис-, проект-, продукт-менеджеры, специалисты по продажам.\n" +
                                "Не является официальным праздником в России.\n\n" +
                                "Профессиональный праздник судебных приставов — людей, выполняющих задачи по обеспечению установленного законами государства порядка деятельности судов, а также по исполнению всех судебных актов и актов специально уполномоченных органов.";
                    case 4:
                        return "День народного единства~В XX и XXI веках дню 22 октября по юлианскому календарю соответствует в григорианском календаре 4 ноября. Именно эта дата — 22 октября по юлианскому календарю, или 4 ноября по григорианскому календарю — выбрана в качестве дня государственного праздника.";
                    case 5:
                        return "День военного разведчика~Профессиональный праздник российских военных, чья служба, так или иначе, связана с военной разведкой.";
                    case 7:
                        return "Годовщина Великой Октябрьской социалистической революции~Государственный праздник в СССР. Отмечался в день свершения Октябрьской революции ежегодно 7 ноября (25 октября по «старому стилю») и 8 ноября.";
                    case 9:
                        return "День специального отряда быстрого реагирования~В этот день в 1978 году в СССР, на основании приказа МВД СССР № 0707, создан первый отряд милиции специального назначения при Главном управлении внутренних дел Мосгорисполкома. Тогда, ОМСН создавался прежде всего для оперативного реагирования и своевременного предотвращения чрезвычайных происшествий во время проведения предстоящих в 1980 году в столице СССР Летних Олимпийских игр. Осенью 1992 года, указом верховного главнокомандующего Б. Н. Ельцина данный отдел был переименован в Специальный отряд быстрого реагирования (СОБР). В 2002 году отряды СОБР были обратно преобразованы в отряды милиции специального назначения (ОМСН). 30 ноября 2011 года приказом Министра внутренних дел Российской Федерации Р. Г. Нургалиева отряды милиции специального назначения МВД России вновь стали официально именоваться специальными отрядами быстрого реагирования (СОБР).";
                    case 10:
                        return "День сотрудника органов внутренних дел Российской Федерации~Профессиональный праздник сотрудников МВД в Российской Федерации (до 1991 года — СССР).";
                    case 11:
                        return "День экономиста~Профессиональный праздник сотрудников, чья работа связана с экономической деятельностью: сотрудников финансовых отделов предприятий, банков, организаций частной и государственной формы собственности, чиновниками соответствующего Министерства.";
                    case 13:
                        return "День войск радиационной, химической и биологической защиты~Праздник приурочен к образованию Химической службы в Рабоче-крестьянской Красной армии (РККА) 13 ноября 1918 года по приказу Революционного Военного Совета Республики № 220";
                    case 14:
                        return "День социолога~Неофициальный профессиональный праздник в Российской Федерации для всех тех, кто так или иначе причастен к социологии — науке о закономерностях становления и развития социальных систем, общностей, групп, личностей.";
                    case 21:
                        return "День работника налоговых органов Российской Федерации~Профессиональный праздник сотрудников налоговых органов РФ.\n" +
                                "21 ноября 1991 года указом Президента РСФСР № 229 была образована Государственная налоговая служба РСФСР. В 1998 году она преобразуется в Министерство Российской Федерации по налогам и сборам, а в 2004 году в Федеральную налоговую службу.";
                    case 22:
                        return "День психолога~Отмечается ежегодно с 1992 года. Установлен по инициативе Всемирной федерации психического здоровья при поддержке Всемирной организации здравоохранения. В России День психического здоровья отмечается с 2002 года по инициативе академика РАМН Т. Б. Дмитриевой.\n" +
                                "День психического здоровья входит в перечень всемирных и международных дней, отмечаемых ООН.";
                    case 27:
                        return "День матери~Международный праздник в честь матерей. В этот день принято поздравлять матерей и беременных женщин, в отличие от Международного женского дня, когда поздравления принимают все представительницы женского пола.\n " +
                                "Профессиональный праздник всех военнослужащих, военнообязанных и гражданского персонала Российской Федерации проходящих (проходивших) службу и работающих в формированиях морской пехоты ВС России.";
                    case 30:
                        return "Международный день защиты информации~Установлен американской Ассоциацией компьютерного оборудования в 1988 году. Целью праздника является напоминание пользователям о необходимости защиты их компьютеров и всей хранимой в них информации.";
                }
                return "";
            case 11:
                switch (i[1]) {
                    case 3:
                        return "День Неизвестного Солдата/День юриста~1)День Неизвестного солдата объявлен Госдумой РФ 24 октября 2014 г., как день памяти обо всех неизвестных солдатах, погибших в годы Великой Отечественной войны.\n\n" +
                                "2)Профессиональный праздник юристов, независимо от сферы их профессиональной деятельности.";
                    case 5:
                        return "День добровольца (волонтёра)~Отмечается в Международный день добровольцев во имя экономического и социального развития, установленный Генеральной Ассамблей ООН в 1985-м году на 40-й сессии в специальной резолюции.";
                    case 9:
                        return "День Героев Отечества~Памятная дата была установлена Государственной Думой Российской Федерации 26 января 2007 года, когда российские парламентарии приняли соответствующий законопроект в первом чтении. В пояснительной записке к документу говорилось следующее: «мы не только отдаём дань памяти героическим предкам, но и чествуем ныне живущих Героев Советского Союза, Героев Российской Федерации, кавалеров ордена Святого Георгия и ордена Славы». Там же авторы законопроекта выражали надежду, что новая памятная дата России будет способствовать «формированию в обществе идеалов самоотверженного и бескорыстного служения Отечеству».";
                    case 12:
                        return "День Конституции Российской Федерации~Празднование принятия Конституции в современной России.\n" +
                                "12 декабря 1993 года всенародным голосованием была принята Конституция Российской Федерации, а с 1994 года указами президента России («О Дне Конституции Российской Федерации» и «О нерабочем дне 12 декабря») день 12 декабря был объявлен государственным праздником.";
                    case 18:
                        return "День работника органов ЗАГС \uD83E\uDD35 \uD83D\uDC70~Декрет «О гражданском браке, о детях и о ведении книг актов состояния» 18 декабря 1917 года положил начало регистрации актов гражданского состояния в государственных органах. Согласно революционному декрету 1917 года единственной формой брака для всех граждан России независимо от вероисповедания стало заключение гражданского брака в государственных органах. Брак, заключённый по религиозному обряду после принятия декрета, не порождал правовых последствий. За браками, заключёнными в церковной форме до принятия декрета, сохранялась юридическая сила, и они не нуждались в переоформлении.";
                    case 20:
                        return "День работника органов безопасности Российской Федерации~Профессиональный праздник сотрудников ФСБ, СВР, ФСО, ГУСП и других специальных органов Российской Федерации.\n" +
                                "В этот день, в 1917 году, Совет народных комиссаров РСФСР издал Декрет об образовании Всероссийской чрезвычайной комиссии (ВЧК) по борьбе с контрреволюцией и саботажем при СНК РСФСР (предшественника современных органов безопасности). Инициатором создания ВЧК был В. И. Ленин. Первым председателем ВЧК стал Феликс Дзержинский.";
                    case 22:
                        return "День энергетика~Профессиональный праздник всех работников энергетической промышленности, охватывающей выработку, передачу и сбыт потребителям электрической и тепловой энергии.";
                    case 27:
                        return "День спасателя Российской Федерации~Профессиональный праздник всех спасателей. В России спасатели работают и служат в территориальных службах спасения, муниципальных службах спасения, частных спасательных службах, разных видах пожарной охраны, нештатных, общественных спасательных организациях и МЧС.\n" +
                                "В этот день Совет министров РСФСР принял постановление «Об образовании Российского корпуса спасателей на правах государственного комитета РСФСР, а также формировании единой государственно-общественной системы прогнозирования, предотвращения и ликвидации последствий чрезвычайных ситуаций»";
                }
                return "";
        }
        return "";
    }
}
